In [21]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from sqlalchemy import create_engine
from sqlalchemy.orm import sessionmaker
from sqlalchemy_utils import database_exists, create_database
from local_settings import postgresql as settings

In [22]:
def get_engine(user, passwd, host, port, db):
    url = f"postgresql://{user}:{passwd}@{host}:{port}/{db}"
    if not database_exists(url):
        create_database(url)
    engine = create_engine(url, pool_size=50, echo=False)
    return engine

In [23]:
engine = get_engine(settings['pguser'],
                    settings['pgpasswd'],
                    settings['pghost'],
                    settings['pgport'],
                    settings['pgdb'] )

In [24]:
engine.url.database

'Project_Success_01'

In [25]:
def get_engine_from_settings():
    keys = ['pguser','pgpasswd','pghost','pgport','pgdb']
    if not all(key in keys for key in settings.keys()):
        raise Exception('Bad config file')
        
    return get_engine(settings['pguser'],
                      settings['pgpasswd'],
                      settings['pghost'],
                      settings['pgport'],
                      settings['pgdb'])

In [26]:
def get_session():
    engine = get_engine_from_settings()
    session = sessionmaker(bind=engine)()
    return session

In [27]:
session = get_session()

In [28]:
session.close()

In [29]:
engine = session.get_bind()
engine.dispose()

In [30]:
conn = engine.connect()

In [33]:
Avgleadtime_other=pd.read_sql("SELECT*FROM AvgLeadTimeOtherGuys", conn)
Avgleadtime_other.head()

      region   leadtime
0    Midwest  15.365343
1      South  14.854839
2       West  15.308708
3  Northeast  15.069792

In [34]:
Avgleadtimewalmart=pd.read_sql("SELECT*FROM Avgleadtimewalmart", conn )
Avgleadtimewalmart.head()

    region  leadtime
0    South  1.953210
1     West  2.086912
2     East  2.021636
3  Central  2.053137

In [35]:
TotalproductSalesbyState=pd.read_sql("SELECT*FROM totalproductsalesbystate", conn )
TotalproductSalesbyState.head()

        state  totalsales
0  California   3793084.4
1       Texas   1827458.5
2    Illinois   1443039.3
3     Florida   1341762.1
4    New York    913518.2

In [36]:
totalwalmartsalesbystate=pd.read_sql("SELECT*FROM totalwalmartsalesbystate", conn )
totalwalmartsalesbystate.head()

        state   totalsales
0  California  1372210.208
1    Illinois   959327.289
2       Texas   863891.026
3     Florida   777663.933
4    New York   738894.190